app/views/assignments/_project_user_commitments.html.erb

SELECT "tasks".* FROM "tasks"  WHERE "tasks"."user_id" = ?  [["user_id", 1]]
---
			</thead>
			<% @user.to_do_tasks(@project).each do |t| %>