app/views/tasks/_form.html.erb

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 5]]
SELECT "users".* FROM "users" INNER JOIN "assignments" ON "users"."id" = "assignments"."user_id" WHERE "assignments"."project_id" = ?  [["project_id", 5]]
---
    <!-- Responsable -->
    <%= f.select :user_id, @task.project.all_users.map{|u| [u.f_name, u.id]}, include_blank: true, label: 'Responsable' %>