app/views/tasks/_task_show_historial.html.erb

SELECT "reports".* FROM "reports"  WHERE "reports"."task_id" = ?  [["task_id", 28]]
---
				<tbody>
					<% @task.reports.each do |report|%>