app/views/tasks/_task_show_observacion.html.erb

				<tbody>
					<% @task.comments.each do |comment|%>
---
SELECT "comments".* FROM "comments"  WHERE "comments"."task_id" = ?  [["task_id", 8]]