app/controllers/assignments_controller.rb

    def set_assignment
      @assignment = Assignment.find(params[:id])
      if params[:project_id]
        @project = Project.find(params[:project_id])
---
SELECT  "assignments".* FROM "assignments"  WHERE "assignments"."id" = ? LIMIT 1  [["id", 8]]
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 5]]