app/controllers/kanban_board_controller.rb

  def update_item_partial
    @task = Task.find(params[:task_id])
---
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 7]]