app/controllers/projects_controller.rb

  def tree_view
    @project = Project.find(params[:project_id])
---
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 5]]

  def add_tree_view_column
    # tarea de la cual se desplegaran sus hijos en una nueva columna del arbol
    @task = Task.find(params[:parent_id])
    @project = Project.find(params[:project_id])
---
SELECT "tasks".* FROM "tasks"  WHERE "tasks"."parent_id" = ?  [["parent_id", 2]]
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 5]]