app/controllers/reports_controller.rb

INSERT INTO "reports" ("created_at", "progress", "task_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-01-15 19:30:20.873511"], ["progress", 80.0], ["task_id", 22], ["updated_at", "2015-01-15 19:30:20.873511"], ["user_id", 1]]
---
  def create
    @report = Report.new(report_params)
    @project = @report.project
    @task = @report.task

    respond_to do |format|
      if @report.save

DELETE FROM "reports" WHERE "reports"."id" = ?  [["id", 14]]
---
  def destroy
    @project = @report.project
    @task = @report.task
    @report_id = @report.id
    @report.destroy

SELECT  "reports".* FROM "reports"  WHERE "reports"."id" = ? LIMIT 1  [["id", 14]]
---
  def set_report
    @report = Report.find(params[:id])