app/controllers/tasks_controller.rb

  def new
    # Creamos una tarea que tendra un proyecto, su padre y la fecha
    @task = Task.new(project_id: params[:project_id])

    # hay veces que se crean tareas de primer nivel por lo que no tienen parent_id, solo corresponden al proyecto.
    if params[:parent_id]
      @task.expected_start_date = [Task.find(params[:parent_id]).expected_start_date, Date.today].max
      @task.expected_end_date = Task.find(params[:parent_id]).expected_end_date
      @task.parent_id = params[:parent_id]
      @task.user_id = Task.find(params[:parent_id]).user_id
---
SELECT "tasks".* FROM "tasks"  WHERE "tasks"."project_id" = ?  [["project_id", 5]]
SELECT "users".* FROM "users" INNER JOIN "assignments" ON "users"."id" = "assignments"."user_id" WHERE "assignments"."project_id" = ?  [["project_id", 5]]

  def create
    @task = Task.new(task_params)
    @project = @task.project
    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("created_at", "expected_end_date", "expected_start_date", "name", "project_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @project = @task.project

    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "updated_at" = ?, "user_id" = ? WHERE "tasks"."id" = 28  [["updated_at", "2015-01-15 15:33:42.103514"], ["user_id", 1]]

    task = Task.find(params[:task_id])
---
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 28]]

  def toggle_urgent
    @task.toggle_urgent
---
UPDATE "tasks" SET "updated_at" = ?, "urgent" = ? WHERE "tasks"."id" = 8  [["updated_at", "2015-01-14 19:37:14.372280"], ["urgent", "t"]]

  def set_task
    if params[:id]
      @task = Task.find(params[:id])
      @project = @task.project

    # cuando es llamada desde otro controlador
    elsif params[:task_id]
      @task = Task.find(params[:task_id])
---
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 8]]
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 5]]
SELECT "tasks".* FROM "tasks"  WHERE "tasks"."project_id" = ?  [["project_id", 5]]