app/views/layouts/_horizontal_menu.erb

                    <ul class="dropdown-menu projects" role="menu">
                        <% @current_user.projects.each do |p| %>
---
SELECT "projects".* FROM "projects" INNER JOIN "assignments" ON "projects"."id" = "assignments"."project_id" WHERE "assignments"."user_id" = ?  [["user_id", 1]]